src/Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Признак ведения учета в в валюте учета </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Цена включает НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОпределенияЦеныКонкурента</Name>
					<Comment>0 - Приоритет,1 - Минимум, 2 - Среднее</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчетаЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОкругления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/АлгоритмПолученияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АлгоритмПолученияЦены</Name>
			<Comment>Алгоритм получения цены для данного типа цен. Задает список полей (аналитик), в разрезе которых происходит получение и установка цен.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
					<Comment>Получать цену только для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоХарактеристике</Name>
					<Comment>Получать цену в разрезе характеристик. Если для характеристики цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницеИзмерения</Name>
					<Comment>Получать цену в разрезе единиц измерения. Если для единицы измерения цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагружаетсяИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиКурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиКурсаВалюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ТипыЦен/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Типы цен"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	МенеджерВалюты = Справочники.Валюты;
	ОснВалютаРуб = МенеджерВалюты.НайтиПоКоду("643");
	
	Если НЕ ЗначениеЗаполнено(ОснВалютаРуб) Тогда
		
		Объект = Справочники.Валюты.СоздатьЭлемент();
		Объект.НаименованиеПолное        = НСтр("ru = 'Российский рубль'");
		Объект.Код                       = "643";
		Объект.Наименование              = "RUB";
		Объект.ЗагружаетсяИзИнтернета    = ЛОЖЬ;
		Объект.СпособУстановкиКурса      = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
		Объект.ПараметрыПрописиНаРусском = НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака'");
		Объект.Записать();
		
		ОснВалютаРуб = Объект.Ссылка;
		
		Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		Запись.Валюта    = ОснВалютаРуб;
		Запись.Период    = '19800101';
		Запись.Курс      = 1;
		Запись.Кратность = 1;
		Запись.Записать();
		
	КонецЕсли;
	
	// Заполнение основного типа цен закупки
	ТипыЦенОсновнойТипЦенЗакупки = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.ПолучитьОбъект();
	
	// Перезаполняем реквизиты
	ТипыЦенОсновнойТипЦенЗакупки.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенОсновнойТипЦенЗакупки.Закупка = Истина;
	ТипыЦенОсновнойТипЦенЗакупки.Точность = 2;
	ТипыЦенОсновнойТипЦенЗакупки.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	НовыйЭлемент = ТипыЦенОсновнойТипЦенЗакупки.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенЗакупки.Модифицированность() Тогда
		Попытка
			ТипыЦенОсновнойТипЦенЗакупки.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенОсновнойТипЦенЗакупки.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Заполнение основного типа цен продажи
	ТипыЦенОсновнойТипЦенПродажи = Справочники.ТипыЦен.ОсновнойТипЦенПродажи.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	ТипыЦенОсновнойТипЦенПродажи.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенОсновнойТипЦенПродажи.Продажа = Истина;
	ТипыЦенОсновнойТипЦенПродажи.Точность = 2;
	ТипыЦенОсновнойТипЦенПродажи.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыЦенОсновнойТипЦенПродажи.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенПродажи.Модифицированность() Тогда
		Попытка
			ТипыЦенОсновнойТипЦенПродажи.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенОсновнойТипЦенПродажи.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Заполнение нормативного типа цен
	ТипыЦенНормативнаяЦена = Справочники.ТипыЦен.НормативнаяЦена.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	ТипыЦенНормативнаяЦена.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенНормативнаяЦена.Закупка = Истина;
	ТипыЦенНормативнаяЦена.Точность = 2;
	ТипыЦенНормативнаяЦена.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	НовыйЭлемент = ТипыЦенНормативнаяЦена.ЭтоНовый();
	Если ТипыЦенНормативнаяЦена.Модифицированность() Тогда
		Попытка
			ТипыЦенНормативнаяЦена.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенНормативнаяЦена.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	
	Если НЕ Объект.ЭтоГруппа Тогда //siniko
		ОбязательныеРеквизиты.Добавить("АлгоритмПолученияЦены");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьМноговалютныйУчет") И НЕ Объект.ВВалютеУчета Тогда
			ОбязательныеРеквизиты.Добавить("ВалютаЦены");
		КонецЕсли;
		Если Объект.Рассчитывается Тогда
			ОбязательныеРеквизиты.Добавить("БазовыйТипЦен");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	УникальныеПроцентыСкидкиНаценки=Новый Массив();
	УникальныеПроцентыСкидкиНаценки.Добавить("ЦеноваяГруппа"); //siniko
	Если НЕ Объект.ЭтоГруппа И ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы") Тогда
		УникальныеРеквизиты.Вставить("ПроцентыСкидкиНаценки",УникальныеПроцентыСкидкиНаценки);
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Рассчитывается");
	Результат.Добавить("БазовыйТипЦен");
	Результат.Добавить("ВалютаЦены");
	Результат.Добавить("ВВалютеУчета");
	Результат.Добавить("ЦенаВключаетНДС");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


// Обработчик события возникающего при изменении данных реквизита "Расчет цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура РасчетЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Рассчитывается И  Объект.РегистрироватьЦеныПоПриходу Тогда
		 Объект.РегистрироватьЦеныПоПриходу = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасчетЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Базовый тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура БазовыйТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	ТекБазовыйТипЦен = Объект.БазовыйТипЦен;
	Пока ЗначениеЗаполнено(ТекБазовыйТипЦен) Цикл
		Если Объект.Ссылка = ТекБазовыйТипЦен Тогда
			ВывестиСообщение(НСтр("ru = 'Текущий тип цен не может быть базовым самому себе.'"),Объект.Ссылка,"БазовыйТипЦен");
		КонецЕсли; 
		ТекБазовыйТипЦен = ТекБазовыйТипЦен.БазовыйТипЦен;
	КонецЦикла; 
	
КонецПроцедуры // БазовыйТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "В валюте учета".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВВалютеУчетаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ВВалютеУчета Тогда
		Если ЗначениеЗаполнено(Объект.ВалютаЦены) Тогда
			Объект.ВалютаЦены = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВВалютеУчетаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Закупка".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЗакупкаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Закупка Тогда
		Если Объект.ВключатьВПрайсЛист Тогда
			Объект.ВключатьВПрайсЛист = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗакупкаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
